<?php

use Illuminate\Database\Migrations\Migration;
use Illuminate\Support\Facades\DB;

class InsertRbStaffFileType extends Migration
{
    /**
     * Run the migrations.
     *
     * @return void
     */
    public function up()
    {
        DB::table('rb_staff_file_type')->insert(["name_ru"=> "Диплом высшего и профессионального (среднего специального, среднего профессионального) образования", "name_kk"=> "Жоғары және кәсіптік (орта арнаулы, орта кәсіптік) білім туралы диплом"]);
        DB::table('rb_staff_file_type')->insert(["name_ru"=> "Сертификат успешно завершенных курсов подготовки или переподготовки кадров", "name_kk"=> "Оқу немесе қайта даярлау курстарынан сәтті өткені туралы сертификат"]);
        DB::table('rb_staff_file_type')->insert(["name_ru"=> "Скан-копии сертификата согласно приказу Министра здравоохранения Республики Казахстан, от 15 декабря 2020 года № ҚР ДСМ-269/2020 «Об утверждении Правил оказания первой помощи лицами без медицинского образования, в том числе прошедшими соответствующую подготовку и Стандарта оказания первой помощи» (зарегистрирован в Реестре государственной регистрации нормативных правовых актов под № 21814) выданный не позднее 24 месяцев к дате подачи заявления", "name_kk"=> "«Алғашқы көмекті медициналық білімі жоқ, оның ішінде тиісті даярлықтан өткен адамдардың көрсету қағидаларын және Алғашқы көмекті көрсету стандартын бекіту туралы» Қазақстан Республикасы Денсаулық сақтау министрінің 2020 жылғы 15 желтоқсандағы № ҚР ДСМ-269/2020 бұйрығына сәйкес анықтаманың сканерленген көшірмелері. білім, оның ішінде тиісті дайындықтан өткен және алғашқы медициналық көмек көрсету стандарты» (Нормативтік құқықтық актілерді мемлекеттік тіркеу тізілімінде № 21814 болып тіркелген) өтініш берген күннен бастап 24 айдан кешіктірмей берілген."]);
        DB::table('rb_staff_file_type')->insert(["name_ru"=> "Скан-копии справки о наличии либо отсутствии судимости, выданной не позднее 10 календарных дней к дате подачи заявления", "name_kk"=> "Өтініш берген күннен бастап 10 күнтізбелік күннен кешіктірілмей берілген соттылығының болуы немесе болмауы туралы анықтаманың сканерленген көшірмелері"]);
        DB::table('rb_staff_file_type')->insert(["name_ru"=> "Скан-копии справки о состоянии/не состоянии на диспансерном наблюдении в наркологической организации, выданной не позднее 10 календарных дней к дате подачи заявления", "name_kk"=> "Өтініш берген күннен бастап 10 күнтізбелік күннен кешіктірілмей берілген наркологиялық ұйымдағы диспансерлік бақылаудағы статусы/мәртебесінің жоқтығы туралы анықтаманың сканерленген көшірмелері"]);
        DB::table('rb_staff_file_type')->insert(["name_ru"=> "Скан-копии справки о состоянии/не состоянии на диспансерном наблюдении в психоневрологической организации, выданной не позднее 10 календарных дней к дате подачи заявления", "name_kk"=> "Өтініш берген күннен бастап 10 күнтізбелік күннен кешіктірмей берілген психоневрологиялық ұйымдағы диспансерлік бақылаудағы жағдайы/жағдайының жоқтығы туралы анықтаманың сканерленген көшірмелері"]);
        DB::table('rb_staff_file_type')->insert(["name_ru"=> "Скан-копии справка со специализированной противотуберкулезной организации, выданная не позднее 10 календарных дней к дате подачи заявления", "name_kk"=> "Мамандандырылған туберкулезге қарсы ұйымнан өтініш берген күннен бастап күнтізбелік 10 күннен кешіктірмей берілген анықтаманың сканерленген көшірмелері"]);
    }

    /**
     * Reverse the migrations.
     *
     * @return void
     */
    public function down()
    {
        //
    }
}
